Revit 2027 API
MultiReferenceAnnotationOptions.GetElementsToDimension Method
 Gets the elements which the dimension will witness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetElementsToDimension()
Public Function GetElementsToDimension As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetElementsToDimension()
member GetElementsToDimension : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The elements which the dimension will witness.
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace